# Lab | Data Aggregation and Filtering

In this challenge, we will continue to work with customer data from an insurance company. We will use the dataset called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by first performing data cleaning, formatting, and structuring.

1. Create a new DataFrame that only includes customers who:
   - have a **low total_claim_amount** (e.g., below $1,000),
   - have a response "Yes" to the last marketing campaign.

2. Using the original Dataframe, analyze:
   - the average `monthly_premium` and/or customer lifetime value by `policy_type` and `gender` for customers who responded "Yes", and
   - compare these insights to `total_claim_amount` patterns, and discuss which segments appear most profitable or low-risk for the company.

3. Analyze the total number of customers who have policies in each state, and then filter the results to only include states where there are more than 500 customers.

4. Find the maximum, minimum, and median customer lifetime value by education level and gender. Write your conclusions.

## Bonus

5. The marketing team wants to analyze the number of policies sold by state and month. Present the data in a table where the months are arranged as columns and the states are arranged as rows.

6.  Display a new DataFrame that contains the number of policies sold by month, by state, for the top 3 states with the highest number of policies sold.

*Hint:*
- *To accomplish this, you will first need to group the data by state and month, then count the number of policies sold for each group. Afterwards, you will need to sort the data by the count of policies sold in descending order.*
- *Next, you will select the top 3 states with the highest number of policies sold.*
- *Finally, you will create a new DataFrame that contains the number of policies sold by month for each of the top 3 states.*

7. The marketing team wants to analyze the effect of different marketing channels on the customer response rate.

Hint: You can use melt to unpivot the data and create a table that shows the customer response rate (those who responded "Yes") by marketing channel.

External Resources for Data Filtering: https://towardsdatascience.com/filtering-data-frames-in-pandas-b570b1f834b9

In [1]:
# your code goes here

import pandas as pd

pd.set_option("display.max_columns", None)

url = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis.csv"

1. Create a new DataFrame that only includes customers who:
   - have a **low total_claim_amount** (e.g., below $1,000),
   - have a response "Yes" to the last marketing campaign.

In [2]:
df = pd.read_csv(url)

df.head()
# No hace falta loc
new_df = df[(df["Total Claim Amount"] < 1000) & (df["Response"] == "Yes")]

new_df.head()

,Unnamed: 0,Customer,State,Customer Lifetime Value,Response,Coverage,Education,Effective To Date,EmploymentStatus,Gender,Income,Location Code,Marital Status,Monthly Premium Auto,Months Since Last Claim,Months Since Policy Inception,Number of Open Complaints,Number of Policies,Policy Type,Policy,Renew Offer Type,Sales Channel,Total Claim Amount,Vehicle Class,Vehicle Size,Vehicle Type
3,3,XL78013,Oregon,22332.439460,Yes,Extended,College,1/11/11,Employed,M,49078,Suburban,Single,97,10.0,3,0.0,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A
8,8,FM55990,California,5989.773931,Yes,Premium,College,1/19/11,Employed,M,66839,Suburban,Single,154,33.0,24,0.0,1,Personal Auto,Personal L1,Offer2,Branch,739.200000,Sports Car,Medsize,NaN
15,15,CW49887,California,4626.801093,Yes,Basic,Master,1/16/11,Employed,F,79487,Suburban,Divorced,114,20.0,87,0.0,1,Special Auto,Special L1,Offer2,Branch,547.200000,SUV,Medsize,NaN
19,19,NJ54277,California,3746.751625,Yes,Extended,College,2/26/11,Employed,F,41479,Rural,Married,94,14.0,38,1.0,1,Personal Auto,Personal L2,Offer2,Call Center,19.575683,Two-Door Car,Large,A
27,27,MQ68407,Oregon,4376.363592,Yes,Premium,Bachelor,2/28/11,Employed,F,63774,Rural,Divorced,111,18.0,63,0.0,1,Personal Auto,Personal L3,Offer2,Agent,60.036683,Four-Door Car,Medsize,NaN

2. Using the original Dataframe, analyze:
   - the average `monthly_premium` and/or customer lifetime value by `policy_type` and `gender` for customers who responded "Yes", and
   - compare these insights to `total_claim_amount` patterns, and discuss which segments appear most profitable or low-risk for the company.

In [3]:
# Nuevo dataframe con reponse == yes
new_df_yes = df[df["Response"] == "Yes"]
# Agrupación por `Policy Type` y `Gender`:
grouped = new_df_yes.groupby(["Policy Type", "Gender"])
# Mean o average para los que respondieron que sí:
grouped[["Monthly Premium Auto", "Customer Lifetime Value", "Total Claim Amount"]].agg(["mean", "count"])

                      Monthly Premium Auto       Customer Lifetime Value  \
                                      mean count                    mean
Policy Type    Gender
Corporate Auto F                 94.301775   169             7712.628736
               M                 92.188312   154             7944.465414
Personal Auto  F                 98.998148   540             8339.791842
               M                 91.085821   536             7448.383281
Special Auto   F                 92.314286    35             7691.584111
               M                 86.343750    32             8247.088702

                            Total Claim Amount
                      count               mean count
Policy Type    Gender
Corporate Auto F        169         433.738499   169
               M        154         408.582459   154
Personal Auto  F        540         452.965929   540
               M        536         457.010178   536
Special Auto   F         35         453.280164    35
               M         32         429.527942    32

In [4]:
# grouped.groupby(["Policy Type", "Gender"])["Total Claim Amount"].mean()

- El segmento más rentable es el de `Personal Auto` en el grupo de `F`. También es uno de los más numerosos. Además no hay un aumento significativo en `Total Claim Amount`.
- Lo sigue el segmento de `Special Auto`en el grupo de `M`, pero son muy poco numerosos, por lo que debemos ser muy cuidadosos a la hora de tomarlo. 
- En general, el grupo `F` paga más con un aumento relativo en `Total Claim Amount`

3. Analyze the total number of customers who have policies in each state, and then filter the results to only include states where there are more than 500 customers.

In [5]:
# Agrupado por state
agrupado_state = df.groupby("State")["Customer"].nunique()

print(agrupado_state)

print(agrupado_state[agrupado_state > 500])

df_clientes_policy = df["State"].value_counts()

print(df_clientes_policy)

agrupado_con_counts = df.groupby("State")["Customer"].count()

print(agrupado_con_counts)

State
Arizona       1703
California    3150
Nevada         882
Oregon        2601
Washington     798
Name: Customer, dtype: int64
State
Arizona       1703
California    3150
Nevada         882
Oregon        2601
Washington     798
Name: Customer, dtype: int64
State
California    3552
Oregon        2909
Arizona       1937
Nevada         993
Washington     888
Name: count, dtype: int64
State
Arizona       1937
California    3552
Nevada         993
Oregon        2909
Washington     888
Name: Customer, dtype: int64

In [6]:
# 4. Find the maximum, minimum, and median customer lifetime value 
# by education level and gender. Write your conclusions.

agrupados_education_gender = df.groupby(["Education", "Gender"])

agrupados_education_gender[["Customer Lifetime Value"]].agg(["mean", "min", "max", "median", "count", "std"])

                            Customer Lifetime Value                            \
                                               mean          min          max
Education            Gender
Bachelor             F                  7874.269478  1904.000852  73225.95652
                     M                  7703.601675  1898.007675  67907.27050
College              F                  7748.823325  1898.683686  61850.18803
                     M                  8052.459288  1918.119700  61134.68307
Doctor               F                  7328.508916  2395.570000  44856.11397
                     M                  7415.333638  2267.604038  32677.34284
High School or Below F                  8675.220201  2144.921535  55277.44589
                     M                  8149.687783  1940.981221  83325.38119
Master               F                  8157.053154  2417.777032  51016.06704
                     M                  8168.832659  2272.307310  50568.25912


                                  median count          std
Education            Gender
Bachelor             F       5640.505303  1700  6614.107319
                     M       5548.031892  1572  6658.460774
College              F       5623.611187  1608  6678.304057
                     M       6005.847375  1596  6716.960507
Doctor               F       5332.462694   200  6930.556300
                     M       5577.669457   201  5460.941400
High School or Below F       6039.553187  1590  7497.848501
                     M       6286.731006  1556  7190.619899
Master               F       5729.855012   475  6621.774653
                     M       5579.099207   412  7362.156626

- El grupo más rentable por media es el grupo `F` con un nivel de estudios `High School or Below` sin embargo es el grupo `M` con ese nivel de estudios el que tiene el máximo: `883325`, lo cual indica mayor presencia de outliers que distorsionan la muestra. Al observar la desviación estándar se aclara: ese es el grupo con mayor desviación.
- Los grupos menos rentables son `F`y `M`con estudios `Doctor`, también son los más predecibles: tienen la menor desviación estándar y los menores máximos. Sin embargo también son la muestra más pequeña. 

Estos datos podrían sugerir la hipótesis de que los grupos con mayores estudios son más predecibles pero menos rentables teniendo como proxy `Customer Lifetime Value`.

5. The marketing team wants to analyze the number of policies sold by state and month. Present the data in a table where the months are arranged as columns and the states are arranged as rows.

In [7]:
df["Effective To Date"].unique()

array(['2/18/11', '1/18/11', '2/10/11', '1/11/11', '1/17/11', '2/14/11',
       '2/24/11', '1/19/11', '1/4/11', '1/2/11', '2/7/11', '1/31/11',
       '1/26/11', '2/28/11', '1/16/11', '2/26/11', '2/23/11', '1/15/11',
       '2/2/11', '2/15/11', '1/24/11', '2/21/11', '2/22/11', '1/7/11',
       '1/28/11', '2/8/11', '2/12/11', '2/20/11', '1/5/11', '2/19/11',
       '1/3/11', '2/3/11', '1/22/11', '1/23/11', '2/5/11', '2/13/11',
       '1/25/11', '2/16/11', '2/1/11', '1/27/11', '1/12/11', '1/20/11',
       '2/6/11', '2/11/11', '1/21/11', '1/29/11', '1/9/11', '2/9/11',
       '2/27/11', '1/1/11', '2/17/11', '2/25/11', '1/13/11', '1/6/11',
       '2/4/11', '1/14/11', '1/10/11', '1/8/11', '1/30/11'], dtype=object)

In [8]:
def extraer_mes(fecha): # lambda x: x.split("/")[0]
    mes = fecha.split("/")[0]
    if mes == "1":
        return "Enero"
    else:
        return "Febrero"

df["Month"] = df["Effective To Date"].apply(extraer_mes)
df.head()

,Unnamed: 0,Customer,State,Customer Lifetime Value,Response,Coverage,Education,Effective To Date,EmploymentStatus,Gender,Income,Location Code,Marital Status,Monthly Premium Auto,Months Since Last Claim,Months Since Policy Inception,Number of Open Complaints,Number of Policies,Policy Type,Policy,Renew Offer Type,Sales Channel,Total Claim Amount,Vehicle Class,Vehicle Size,Vehicle Type,Month
0,0,DK49336,Arizona,4809.216960,No,Basic,College,2/18/11,Employed,M,48029,Suburban,Married,61,7.0,52,0.0,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,NaN,Febrero
1,1,KX64629,California,2228.525238,No,Basic,College,1/18/11,Unemployed,F,0,Suburban,Single,64,3.0,26,0.0,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,NaN,Enero
2,2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2/10/11,Employed,M,22139,Suburban,Single,100,34.0,31,0.0,2,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A,Febrero
3,3,XL78013,Oregon,22332.439460,Yes,Extended,College,1/11/11,Employed,M,49078,Suburban,Single,97,10.0,3,0.0,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A,Enero
4,4,QA50777,Oregon,9025.067525,No,Premium,Bachelor,1/17/11,Medical Leave,F,23675,Suburban,Married,117,NaN,31,NaN,7,Personal Auto,Personal L2,Offer1,Branch,707.925645,Four-Door Car,Medsize,NaN,Enero

In [9]:
df_pivot = df.pivot_table(index = 'State', columns = 'Month', values = 'Number of Policies', aggfunc = 'sum', fill_value=0)

df_pivot

Month       Enero  Febrero
State
Arizona      3052     2864
California   5673     4929
Nevada       1493     1278
Oregon       4697     3969
Washington   1358     1225

In [10]:
df.groupby(["State", "Month"])["Customer"].count()

State       Month
Arizona     Enero      1008
            Febrero     929
California  Enero      1918
            Febrero    1634
Nevada      Enero       551
            Febrero     442
Oregon      Enero      1565
            Febrero    1344
Washington  Enero       463
            Febrero     425
Name: Customer, dtype: int64

In [11]:
df_pivot["Total_ventas"] = df_pivot["Enero"] + df_pivot["Febrero"]
df_pivot.dtypes

Month
Enero           int64
Febrero         int64
Total_ventas    int64
dtype: object

In [12]:
df_pivot.sort_values(by = 'Total_ventas', ascending=False)

Month       Enero  Febrero  Total_ventas
State
California   5673     4929         10602
Oregon       4697     3969          8666
Arizona      3052     2864          5916
Nevada       1493     1278          2771
Washington   1358     1225          2583

6.  Display a new DataFrame that contains the number of policies sold by month, by state, for the top 3 states with the highest number of policies sold.

*Hint:*
- *To accomplish this, you will first need to group the data by state and month, then count the number of policies sold for each group. Afterwards, you will need to sort the data by the count of policies sold in descending order.*
- *Next, you will select the top 3 states with the highest number of policies sold.*
- *Finally, you will create a new DataFrame that contains the number of policies sold by month for each of the top 3 states.*

In [13]:
df_state_month = df.groupby(['State', 'Month'])['Number of Policies'].sum()
df_state_month

State       Month
Arizona     Enero      3052
            Febrero    2864
California  Enero      5673
            Febrero    4929
Nevada      Enero      1493
            Febrero    1278
Oregon      Enero      4697
            Febrero    3969
Washington  Enero      1358
            Febrero    1225
Name: Number of Policies, dtype: int64

In [14]:
df_counts = df_state_month.reset_index(name='Policies')
df_counts

        State    Month  Policies
0     Arizona    Enero      3052
1     Arizona  Febrero      2864
2  California    Enero      5673
3  California  Febrero      4929
4      Nevada    Enero      1493
5      Nevada  Febrero      1278
6      Oregon    Enero      4697
7      Oregon  Febrero      3969
8  Washington    Enero      1358
9  Washington  Febrero      1225

In [15]:
df_counts[df_counts['Month'] == 'Enero'].sort_values(by = 'Policies', ascending = False).head(3)

        State  Month  Policies
2  California  Enero      5673
6      Oregon  Enero      4697
0     Arizona  Enero      3052

7

In [16]:
df_response = df.pivot_table(index = 'Sales Channel', columns = 'Response', values = ['Customer'], aggfunc = 'count')

df_response["Response_rate"] = round((df_response[("Customer", "Yes")] /(df_response[("Customer", "Yes")] + df_response[("Customer", "No")])), 2)*100
df_response

              Customer      Response_rate
Response            No  Yes
Sales Channel
Agent             3148  742          19.0
Branch            2539  326          11.0
Call Center       1792  221          11.0
Web               1334  177          12.0